app/Controllers/Home.php

SELECT `pembayaran`.*, `produk`.`title` as `produk_nama`, `user`.`full_name` as `user_nama`
FROM `pembayaran`
JOIN `produk` ON `produk`.`id_produk` = `pembayaran`.`id_produk`
JOIN `user` ON `user`.`user_id` = `pembayaran`.`user_id`
ORDER BY `pembayaran`.`created_at` DESC
---
    public function historipembelian()
    {
        $session = session();
        $user_id = $session->get('user_id'); // ambil ID user dari session login
        $role = $session->get('role');

        if (!$user_id) {
            return redirect()->to(site_url('login'));
        }

        $pembayaranModel = new PembayaranModel();

        // Jika admin, ambil semua data pembelian
        if ($role === 'Admin') {
            $data['pembayaran'] = $pembayaranModel
                ->select('pembayaran.*, produk.title as produk_nama, user.full_name as user_nama')
                ->join('produk', 'produk.id_produk = pembayaran.id_produk')
                ->join('user', 'user.user_id = pembayaran.user_id') // join untuk ambil nama user
                ->orderBy('pembayaran.created_at', 'DESC')
                ->findAll();