app/Controllers/Pembayaran.php

    public function simpanpembayaran()
    {
        $session = session();
        if ($session->get('login') !== true) {
        return redirect()->to(base_url());
        }

        $model = new PembayaranModel();
        $userModel = new UserModel();
        $produkModel = new ProdukModel(); // Tambahkan model produk

        $user_id = $this->request->getPost('user_id');
        $id_produk = $this->request->getPost('id_produk');


        // Ambil data user
        $user = $userModel->find($user_id);
        if (!$user) {
            return redirect()->back()->with('error', 'User tidak ditemukan.');
        }

        // Ambil data produk
        $produk = $produkModel->find($id_produk);
        if (!$produk) {
            return redirect()->back()->with('error', 'Produk tidak ditemukan.');
        }

        // Cek apakah sudah pernah beli dan statusnya 'paid'
        $sudahBeli = $model->where([
            'user_id' => $user_id,
            'id_produk' => $id_produk,
            'status' => 'paid'
        ])->first();
---
SELECT *
FROM `user`
WHERE `user`.`user_id` = '1'
SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '1'
SELECT *
FROM `pembayaran`
WHERE `user_id` = '1'
AND `id_produk` = '1'
AND `status` = 'paid'
 LIMIT 1

    public function proses($id_produk)
    {
        $session = session();
        $user_id = $session->get('user_id');
        if (!$user_id) {
            return redirect()->to('/login');
        }

        $userModel = new UserModel();
        $produkModel = new ProdukModel();

        $user = $userModel->find($user_id);
        $produk = $produkModel->find($id_produk);
---
SELECT *
FROM `user`
WHERE `user`.`user_id` = '1'
SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '1'

    public function instruksi($id)
    {


        $session = session();
        $userId = $session->get('user_id'); // asumsikan ini ID user login
        $userRole = $session->get('role');

        $pembayaranModel = new PembayaranModel();
        $produkModel = new ProdukModel();

        $pembayaran = $pembayaranModel->find($id);

        if (!$pembayaran) {
            return redirect()->to('/courses')->with('error', 'Data pembayaran tidak ditemukan.');
        }

        // Jika bukan admin dan bukan pemilik pembayaran, tolak akses
        if (!$this->isAuthorizedUser($pembayaran['user_id'])) {
            return redirect()->to(base_url())->with('error', 'Anda tidak berhak mengakses halaman ini.');
        }


        $produk = $produkModel->find($pembayaran['id_produk']);
---
SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '1'